<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class CreateTermsTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('terms', function (Blueprint $table) {
            $table->increments('id');
            $table->string('title');
            $table->string('title_en');
            $table->text('content');
            $table->text('content_en');
            $table->timestamps();
        });

        $term = new \App\Term;
        $term->title = 'Ерөнхий зүйл';
        $term->title_en = 'Ерөнхий зүйл';
        $term->content = 'iHotel.mn цахим хуудсыг болон түүнд агуулагдаж байгаа бүх текст, фото, график, видео, дуу авианы контентуудыг бүхэлд нь Айхотел ХХК хариуцдаг болно. Хэрэглэгч нь энэхүү журамд нийцүүлэн уг сайтыг хэрэглэх ёстой.Хэрвээ дурдсан нөхцлүүдийг зөвшөөрөхгүй бол сайтад хандах болон хэрэглэхээс татгалзахыг зөвлөж байна. Айхотел ХХК нь үйлчилгээний нөхцөлд хүссэн үедээ өөрчлөлт хийх бүрэн эрхтэй. Хийгдсэн өөрчлөлтүүд нь сайтад нийтлэгдсэн мөчөөс хүчин төгөлдөр үйлчилнэ. Хэрэглэгч нь нөхцөлд орсон өөрчлөлтийг нийтлэгдсэнээс хойш хэрэглэвэл хүлээн зөвшөөрсөнд тооцогдоно. Айхотел ХХК нь сайтын агуулга, үйлчилгээний бүтэц, хэлбэр загвар зэрэгт хүссэн үедээ, хүссэн өөрчлөлт шинэчлэлтээ хийх эрхтэй.';
        $term->content_en = 'iHotel.mn цахим хуудсыг болон түүнд агуулагдаж байгаа бүх текст, фото, график, видео, дуу авианы контентуудыг бүхэлд нь Айхотел ХХК хариуцдаг болно. Хэрэглэгч нь энэхүү журамд нийцүүлэн уг сайтыг хэрэглэх ёстой.Хэрвээ дурдсан нөхцлүүдийг зөвшөөрөхгүй бол сайтад хандах болон хэрэглэхээс татгалзахыг зөвлөж байна. Айхотел ХХК нь үйлчилгээний нөхцөлд хүссэн үедээ өөрчлөлт хийх бүрэн эрхтэй. Хийгдсэн өөрчлөлтүүд нь сайтад нийтлэгдсэн мөчөөс хүчин төгөлдөр үйлчилнэ. Хэрэглэгч нь нөхцөлд орсон өөрчлөлтийг нийтлэгдсэнээс хойш хэрэглэвэл хүлээн зөвшөөрсөнд тооцогдоно. Айхотел ХХК нь сайтын агуулга, үйлчилгээний бүтэц, хэлбэр загвар зэрэгт хүссэн үедээ, хүссэн өөрчлөлт шинэчлэлтээ хийх эрхтэй.';
        $term->save();

        $term = new \App\Term;
        $term->title = 'Оюуны өмчлөл';
        $term->title_en = 'Оюуны өмчлөл';
        $term->content = 'Сайтад нийтлэгдсэн текст, дуу авиа, график зураг, лого, фото, видео болон бусад бүх контентуудын оюуны өмчлөл нь Монгол Улсын холбогдох хууль тогтоомжийн дагуу баталгаажсан болно. Сайтын аливаа контентыг хэрэглэгч нь зөвхөн хувийн хэрэгцээндээ ашиглах эрхтэй. Айхотел ХХК-ийн зөвшөөрөлгүйгээр контентыг хувилж тараах, нийтлэх, арилжааны зорилгоор ашиглахыг хориглоно. Хэрэглэгч нь сайтын аливаа контентыг хуулж, татаж авснаар өмчлөх эрх шилжихгүй гэдгийг анхааруулж байна.';
        $term->content_en = 'Сайтад нийтлэгдсэн текст, дуу авиа, график зураг, лого, фото, видео болон бусад бүх контентуудын оюуны өмчлөл нь Монгол Улсын холбогдох хууль тогтоомжийн дагуу баталгаажсан болно. Сайтын аливаа контентыг хэрэглэгч нь зөвхөн хувийн хэрэгцээндээ ашиглах эрхтэй. Айхотел ХХК-ийн зөвшөөрөлгүйгээр контентыг хувилж тараах, нийтлэх, арилжааны зорилгоор ашиглахыг хориглоно. Хэрэглэгч нь сайтын аливаа контентыг хуулж, татаж авснаар өмчлөх эрх шилжихгүй гэдгийг анхааруулж байна.';
        $term->save();

        $term = new \App\Term;
        $term->title = 'Гуравдагч этгээдийн контент';
        $term->title_en = 'Гуравдагч этгээдийн контент';
        $term->content = 'Сайт нь гэрээний үндсэн дээр гуравдагч мэдээллийн эх үүсвэрийн контент,байгууллагын үйлчилгээний танилцуулга, үнийн саналыг нийтэлнэ. Тэдгээр мэдээлэл нь тус тусын зохиогч, өмчлөгчтэй байх ба сайт нь гэрээнийнөхцлөөс гадуур эзэмших эрхгүй. Гуравдагч этгээдийн контентод туссан мэдээллийн үнэн зөв байдал, үйлчилгээний чанарын өмнөөс цахим хуудас нь хариуцлага хүлээхгүй. Хэрэглэгч нь эдгээр контентын үнэн зөв байдал, үйлчилгээний чанарт зэрэгт хувийн үнэлэлт дүгнэлтээ өгөх үүрэгтэй.';
        $term->content_en = 'Сайт нь гэрээний үндсэн дээр гуравдагч мэдээллийн эх үүсвэрийн контент,байгууллагын үйлчилгээний танилцуулга, үнийн саналыг нийтэлнэ. Тэдгээр мэдээлэл нь тус тусын зохиогч, өмчлөгчтэй байх ба сайт нь гэрээнийнөхцлөөс гадуур эзэмших эрхгүй. Гуравдагч этгээдийн контентод туссан мэдээллийн үнэн зөв байдал, үйлчилгээний чанарын өмнөөс цахим хуудас нь хариуцлага хүлээхгүй. Хэрэглэгч нь эдгээр контентын үнэн зөв байдал, үйлчилгээний чанарт зэрэгт хувийн үнэлэлт дүгнэлтээ өгөх үүрэгтэй.';
        $term->save();

        $term = new \App\Term;
        $term->title = 'Сурталчилгаа';
        $term->title_en = 'Сурталчилгаа';
        $term->content = 'Цахим хуудас нь арилжааны зорилгоор сурталчилгаа байршуулах эрхтэй. Хэрэглэгч болон сурталчлагч байгууллагын хоорондын харилцаанд Цахим хуудас огт оролцохгүй ба үүнтэй холбоотой үүссэн аливаа маргаан, үл ойлголцолд Сайт хариуцлага хүлээхгүй.';
        $term->content_en = 'Цахим хуудас нь арилжааны зорилгоор сурталчилгаа байршуулах эрхтэй. Хэрэглэгч болон сурталчлагч байгууллагын хоорондын харилцаанд Цахим хуудас огт оролцохгүй ба үүнтэй холбоотой үүссэн аливаа маргаан, үл ойлголцолд Сайт хариуцлага хүлээхгүй.';
        $term->save();

        $term = new \App\Term;
        $term->title = 'Барааны тэмдэгт';
        $term->title_en = 'Барааны тэмдэгт';
        $term->content = 'Цахим хуудаст нийтлэгдсэн Айхотел ХХК-нд харъяалагдах бүх үйлчилгээ, бүтээгдэхүүний барааны тэмдэгт нь тус компаний өмчид тооцогдоно. Цахим хуудаст нийтлэгдсэн гуравдагч этгээдүүдийн барааны тэмдэгтүүд нь тус тусын эзэмшигчдийн өмчид тооцогдоно.';
        $term->content_en = 'Цахим хуудаст нийтлэгдсэн Айхотел ХХК-нд харъяалагдах бүх үйлчилгээ, бүтээгдэхүүний барааны тэмдэгт нь тус компаний өмчид тооцогдоно. Цахим хуудаст нийтлэгдсэн гуравдагч этгээдүүдийн барааны тэмдэгтүүд нь тус тусын эзэмшигчдийн өмчид тооцогдоно.';
        $term->save();
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('terms');
    }
}
